package com.hjh_database.dungeon.zhenyao

internal object ChiyouDialogue {
    val other = listOf(
        "§7你登上了镇妖塔的塔顶，却不见新的妖物出现。",
        "§7然而就在此时，一阵§c妖风§f凭空卷起，若隐若现地盘旋在你面前。",
        "§4§l？？？：§f……一帮小崽子，倒是有几分能耐，竟能苟延残喘爬到这来。",
        "§7话音未落，一道凶神恶煞的身影自妖风中骤然显现，却带着几分§e不真切§f的虚浮之感。",
        "§4§l妖族大长老——蚩尤：§f夺我族财物，杀我族族人——这§c血债§f，今日便要你们§c血偿§f！",
        "§4§l妖族大长老——蚩尤：§f都给我留在这塔下，给那些死去的族人陪葬吧！",
        "§c请击杀妖族大长老——蚩尤，逃出镇妖塔！"
    )
    val yao = listOf(
        "§7你登上了镇妖塔的塔顶，却感觉不到新的妖物气息。",
        "§7但就在这时，一股§a熟悉的妖气§f在你面前若隐若现，似有故人将至。",
        "§4§l？？？：§f……小子，你来了。老夫在此候你许久了。",
        "§7一道身影自妖气中一步踏出，形貌如生，却隐隐透着§e虚浮之意§f，不似真身。",
        "§4§l妖族大长老——蚩尤：§f别摆出那副蠢样。老夫说过，你一路打上来，终会撞见“我”。",
        "§4§l妖族大长老——蚩尤：§f此乃老夫留在此处的§e幻象§f。不过，想过去可没那么轻松——来！让我看看我族后生的拳头，到底§c够不够硬§f！",
        "§c击败妖族大长老——蚩尤的幻象，证明你的实力！"
    )
}
